import numpy as np
import matplotlib.pyplot as plt

# Данные для первого графика (стратегия A)
x1 = np.array([100,10100,20100,30100,40100,50100,60100,70100,80100,90100,100100,110100,120100,130100,140100])
y1 = np.array([9,865.2,1733.3,2643.3,3492.8,4392,5260.6,6186.3,6913.7,7982.4,8851.8,9729.8,10653.1,12450.7,14470.4])

# Данные для второго графика (стратегия B)
x2 = np.array([100,10100,20100,30100,40100,50100,60100,70100,80100,90100,100100,110100,120100,130100,140100])
y2 = np.array([20.8,1067.9,2029.2,3033.3,4057.9,5046.2,6018.8,7107.8,8068,9037.2,10085.2,11058.1,12119.6,13252.1,14137.9])

# Данные для третьего графика (стратегия C)
x3 = np.array([100,10100,20100,30100,40100,50100,60100,70100,80100,90100,100100,110100,120100,130100,140100])
y3 = np.array([10,1041.7,2074,3090.3,4116.2,5238.3,6240.5,7264.2,8326.3,9259,10368.8,11435.5,12478.5,13485.2,14599.8])

# Создаем рисунок и оси для трех графиков
fig, (ax1, ax2, ax3) = plt.subplots(1, 3, figsize=(15, 5))

# Строим первый график (стратегия A)
ax1.plot(x1, y1)
ax1.set_title('График 1 (стратегия A)')
ax1.set_xlabel('Значение n')
ax1.set_ylabel('Время выполнения (мс)')

# Строим второй график (стратегия B)
ax2.plot(x2, y2)
ax2.set_title('График 2 (стратегия B)')
ax2.set_xlabel('Значение n')
ax2.set_ylabel('Время выполнения (мс)')

# Строим третий график (стратегия C)
ax3.plot(x3, y3)
ax3.set_title('График 3 (стратегия C)')
ax3.set_xlabel('Значение n')
ax3.set_ylabel('Время выполнения (мс)')

# Показываем графики
plt.tight_layout()
plt.show()
